load-test.yml
# artillery run load-test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60 # Test duration in seconds
      arrivalRate: 100 # Number of new virtual users per second
scenarios:
  - flow:
      - post:
          url: "/api/register"
          json:
            name: "Test User"
            email: "testuser@example.com"
            password: "password123"